app/controllers/articles_controller.rb

    def index
        @articles = Article.all;
---
SELECT "articles".* FROM "articles"

    def show
        @article = Article.find(params[:id]);
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def create
        # render plain: params[:article].inspect;

        @article = Article.new(article_params);
        if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This big old title"], ["text", "sfsdfsfsdf"], ["created_at", "2020-02-16 19:39:00.058277"], ["updated_at", "2020-02-16 19:39:00.058277"]]